Revit 2027 API
SymbolTypeId.Gal Property
 Symbol gal, indicating unit US gallons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Gal { get; }
Public Shared ReadOnly Property Gal As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Gal {
	ForgeTypeId^ get ();
}
static member Gal : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace